       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NAME        PIC X(30) VALUE SPACES.
       01  WS-GREETING    PIC X(50).
       PROCEDURE DIVISION.
       A000-MAIN SECTION.
       A100-START.
           MOVE "WORLD" TO WS-NAME.
           STRING "HELLO, " DELIMITED SIZE
                  WS-NAME  DELIMITED SPACES
                  INTO WS-GREETING.
           DISPLAY WS-GREETING.
           STOP RUN.
