       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVOICE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-INVOICE-NUM    PIC 9(8).
       COPY DATE-UTILS.
       COPY CUSTOMER-REC.
       01  WS-TOTAL           PIC 9(9)V99.
       LINKAGE SECTION.
       COPY LINK-PARAMS.
       PROCEDURE DIVISION.
       A000-MAIN SECTION.
       A100-START.
           MOVE 100 TO WS-TOTAL.
           CALL "CALC-TOTAL" USING WS-TOTAL.
           STOP RUN.
